uhnp/src/InformationRegisters/ТН_Интеграция_НастройкиТрафикаИсходящихСообщений/ТН_Интеграция_НастройкиТрафикаИсходящихСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТН_Интеграция_НастройкиТрафикаИсходящихСообщений</name>
  <comment>//Ведутенко С.А. от 15.08.2025 Выполнение задач №000054799</comment>
  <resources>
    <name>КонтрольНеотправленных</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЛимитНеотправленных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрольНедоставленных</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЛимитНедоставленных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>УзелПланаОбмена</name>
    <type>
      <types>ExchangePlanRef.тн_Интеграция_УПП_ЦБ</types>
      <types>ExchangePlanRef.тн_Интеграция_УПП</types>
      <types>ExchangePlanRef.тн_Интеграция_УПП_ОКС</types>
      <types>ExchangePlanRef.тн_Интеграция_ЗУП</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ТН_Интеграция_НастройкиТрафикаИсходящихСообщений/Forms/ФормаГрупповогоИзмененияЗаписей/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДополнительныйРеквизитФормы_СтруктураИзменяемыхПолей = Новый Структура;
	
	Если Параметры.Свойство("РежимГрупповогоИзменения") И Параметры.РежимГрупповогоИзменения Тогда	
		ПервоначальноеОформлениеРедактируемыхЭлементовФормы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрольНеотправленныхПриИзменении(Элемент)
	Элементы.ЛимитНеотправленных.АвтоОтметкаНезаполненного = КонтрольНеотправленных;
	ОформлениеИзмененногоЭлементаФормы(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КонтрольНедоставленныхПриИзменении(Элемент)
	Элементы.ЛимитНедоставленных.АвтоОтметкаНезаполненного = КонтрольНедоставленных;
	ОформлениеИзмененногоЭлементаФормы(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЛимитНеотправленныхПриИзменении(Элемент)
	ОформлениеИзмененногоЭлементаФормы(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЛимитНедоставленныхПриИзменении(Элемент)
	ОформлениеИзмененногоЭлементаФормы(Элемент.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьЗаписиРегистра(Команда)

	Если Не РазрешеноИзменятьЗаписиРегистра() Тогда
		Возврат;		
	КонецЕсли;
	
	Закрыть(ДополнительныйРеквизитФормы_СтруктураИзменяемыхПолей);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция РазрешеноИзменятьЗаписиРегистра()

	Результат = Истина;
	МассивОшибок = Новый Массив;	
	
	Если КонтрольНеотправленных И Не ЗначениеЗаполнено(ЛимитНеотправленных) Тогда
		МассивОшибок.Добавить("Не заполнен ""Лимит неотправленных""");	
	КонецЕсли;
	
	Если КонтрольНедоставленных И Не ЗначениеЗаполнено(ЛимитНедоставленных) Тогда
		МассивОшибок.Добавить("Не заполнен ""Лимит недоставленных""");	
	КонецЕсли;
	
	Если Не МассивОшибок.Количество() = 0 Тогда
		Результат = Ложь;
		МассивОшибок.Вставить(0, "Не удалось изменить записи, причина:");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрСоединить(МассивОшибок, Символы.ПС));	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИзменяемыеПоляРегистра()

	Результат = Новый Структура;
	
	Для Каждого РеквизитФормы Из ПолучитьРеквизиты() Цикл
		
		Если ДополнительныйРеквизитФормы_СтруктураИзменяемыхПолей = Неопределено
			Или Не ДополнительныйРеквизитФормы_СтруктураИзменяемыхПолей.Найти(РеквизитФормы.Имя) = Неопределено Тогда
			Результат.Вставить(РеквизитФормы.Имя, ЭтотОбъект[РеквизитФормы.Имя]);			
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ОформлениеИзмененногоЭлементаФормы(ИмяЭлемента)
	
	Если ДополнительныйРеквизитФормы_СтруктураИзменяемыхПолей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементФормы = Элементы[ИмяЭлемента];
	ЭлементФормы.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	ЭлементФормы.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветТекстаФормы;
	
	ДополнительныйРеквизитФормы_СтруктураИзменяемыхПолей.Вставить(ЭлементФормы.ПутьКДанным, ЭтотОбъект[ИмяЭлемента]);

КонецПроцедуры

&НаСервере
Процедура ПервоначальноеОформлениеРедактируемыхЭлементовФормы()
	
	Для Каждого РеквизитФормы Из ПолучитьРеквизиты() Цикл
		
		Если Не СтрНайти(РеквизитФормы.Имя, "ДополнительныйРеквизитФормы_") = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементФормы = Элементы.Найти(РеквизитФормы.Имя);
		Если Не ЭлементФормы = Неопределено Тогда
			ЭлементФормы.ЦветТекста = ЦветаСтиля.НезаполненнаяАналитика;
			ЭлементФормы.ЦветТекстаЗаголовка = ЦветаСтиля.НезаполненнаяАналитика;						
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
	
#КонецОбласти
